<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.bigmacadmin.download.BrightAuthor-BAConnected</string>
    <key>Description</key>
    <string>Downloads the latest BrightAuthor:connected for Mac from BrightSign.</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_JSON_URL</key>
        <string>https://brightsign-builds.s3.us-east-1.amazonaws.com/web/bs-download-versions.json</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_JSON_URL%</string>
                <key>re_pattern</key>
                <string>"mac-link"\s*:\s*"([^"]+\.dmg)"</string>
                <key>result_output_var_name</key>
                <string>found_url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%found_url%</string>
                <key>filename</key>
                <string>BrightAuthorConnected.dmg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>