<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>This is a BETA test recipe.
	Created with Recipe Robot v2.3.2 (https://github.com/homebysix/recipe-robot)
	This recipe  checks whether or not DNSFilter is installed and active. It does not do updates, instead relying on the built in DNSFilter update engine.
	
	Define the DNSFilter Site Secret Key Deployment Code as an Input in your override for this to work in your environment.
	The &quot;SITE_SECRET_KEY_DESCRIPTION&quot; gets added to the name value to allow for multiple site keys to exist in your munki repo.
	</string>
	<key>Description</key>
	<string>Downloads the latest version of DNSFilter Agent and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.bigmacadmin.munki.DNSFilterAgent</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>ITUtilities</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>DNSFilter Agent</string>
		<key>SITE_SECRET_KEY</key>
		<string></string>
		<key>SITE_SECRET_KEY_DESCRIPTION</key>
		<string></string>
		<key>pkginfo</key>
		<dict>
			<key>postinstall_script</key>
			<string>#!/bin/zsh --no-rcs
# shellcheck shell=bash
#set -x

# DNSFilter-postinstall_script.sh by: Trevor Sysock
# 2025-05-30
# v.1.0

munkiCacheFolder=&quot;/Library/Managed Installs/Cache&quot;
configFile=&quot;$munkiCacheFolder/dns_agent.conf&quot;

# If the config file exists, delete it
if [ -f &quot;$configFile&quot; ]; then
    echo &quot;Removing existing config file: $configFile&quot;
    rm -f &quot;$configFile&quot;
fi

exit 0</string>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Block Threats At the DNS Level.</string>
			<key>developer</key>
			<string>DNSFilter, Inc.</string>
			<key>display_name</key>
			<string>DNSFilter Agent</string>
			<key>installcheck_script</key>
			<string>#!/bin/zsh --no-rcs
# shellcheck shell=bash
#set -x

# DNSFilter-InstallCheck.sh by: Trevor Sysock
# 2025-05-30
# v.2.0

# Munki wiki: https://github.com/munki/munki/wiki/How-Munki-Decides-What-Needs-To-Be-Installed#install-check-script
# An &quot;installcheck_script&quot; should be crafted such that an exit code of 0 indicates that the item 
# is currently NOT installed and should therefore be installed. All non-zero exit codes indicate 
# that the item in question is installed.

# This script will determine whether DNSFilter needs to be installed or re-installed
# Checks for LaunchAgent/Daemon status
# Checks for app bundle presence

# Syntax:
#   Variables and arrays are &quot;camel case&quot;: $thisIsAVariable
#   Functions are &quot;snake case&quot;: this_is_a_function
#   Functions are declared with the declaration of &quot;function this_is_a_function(){}&quot;

#################
#   Variables   #
#################
reinstallApp=false

requiredAppPath=&quot;/Applications/DNSFilter Agent.app&quot;

requiredLaunchDaemonList=(
    &apos;com.dnsfilter.agent.macos.helper&apos;
)

##########################
#   Script Starts Here   #
##########################

if [ ! -d &quot;$requiredAppPath&quot; ]; then
    reinstallApp=true
fi

if ! &quot;$reinstallApp&quot;; then
    # Check if Munki LaunchD items are enabled
    launchDList=$(launchctl list | grep -v &apos;com.apple&apos; | awk &apos;{print $3}&apos;)

    # Iterate over each label in the requiredLaunchDList array
    for label in &quot;${requiredLaunchDaemonList[@]}&quot;; do
        # Check if the current label exists in the launchDList
        if echo &quot;${launchDList}&quot; | grep -q &quot;${label}&quot; ; then
            # If the label is found, do nothing (true is a no-op)
            true
        else
            # If the label is not found, print a message and set reinstallApp to true
            echo &quot;LaunchD label missing. Setting install to true: ${label}&quot;
            reinstallApp=true
        fi
    done
fi

if &quot;$reinstallApp&quot;; then
    exit 0
else
    exit 1
fi
</string>
			<key>name</key>
			<string>%NAME%-%SITE_SECRET_KEY_DESCRIPTION%</string>
			<key>preinstall_script</key>
			<string>#!/bin/zsh --no-rcs
# shellcheck shell=bash
#set -x

# DNSFilter-preinstall_script.sh by: Trevor Sysock
# 2025-05-30
# v.1.0

# This script is based off the deployment script provided by DNSFilter as of 2025-05-30 for v2.2 and higher.
# https://help.dnsfilter.com/hc/en-us/articles/41062760716307-Install-macOS-Roaming-Client-v2-2-0-or-higher

# Syntax:
#   Variables and arrays are &quot;camel case&quot;: $thisIsAVariable
#   Functions are &quot;snake case&quot;: this_is_a_function
#   Functions are declared with the declaration of &quot;function this_is_a_function(){}&quot;

#################
#   Variables   #
#################
siteKey=%SITE_SECRET_KEY%

munkiCacheFolder=&quot;/Library/Managed Installs/Cache&quot;
configFile=&quot;$munkiCacheFolder/dns_agent.conf&quot;
##########################
#   Script Starts Here   #
##########################
if [ -z &quot;$siteKey&quot; ]; then
    echo &quot;Site Secret Key is not set. Exiting preinstall script.&quot;
    exit 1
else
    echo &quot;Site Secret Key is set to: $siteKey&quot;
fi

# If a config file already exists, delete it
if [ -f &quot;$configFile&quot; ]; then
    echo &quot;Removing existing config file: $configFile&quot;
    rm -f &quot;$configFile&quot;
fi

# Create temporary config file
cat &gt; &quot;$configFile&quot; &lt;&lt; EOF
SITE_SECRET_KEY=&quot;$siteKey&quot;
LOCAL_DNS_AND_DOMAINS=&quot;&quot;
OVERRIDE_CONFIG_FILE=yes
EOF

# Flush DNS cache
dscacheutil -flushcache
killall -HUP mDNSResponder || true
killall mDNSResponderHelper || true

exit 0</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>uninstall_script</key>
			<string>#!/bin/zsh --no-rcs
# shellcheck shell=bash
#set -x

# DNSFilter-uninstall_script.sh by: Trevor Sysock
# 2025-05-30
# v.1.0

# Based off of DNSFilter documentation found here: https://help.dnsfilter.com/hc/en-us/articles/24995984792339-Uninstall-macOS-Roaming-Clients-v1-8-6-and-older#h_01HA4Y3BZ9M0RXT4NZSFD3GZMV

sh &quot;/Applications/DNSFilter Agent.app/Contents/Resources/uninstall.sh&quot;</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.bigmacadmin.download.DNSFilterAgent</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
